{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 4,
      "special": true,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 36,
      "special": false,
      "content": "a",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 286,
      "special": false,
      "content": "the",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 287,
      "special": false,
      "content": "other",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 288,
      "special": false,
      "content": "sahil",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 289,
      "special": false,
      "content": "jain",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 290,
      "special": false,
      "content": "is",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 291,
      "special": false,
      "content": "interest",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 292,
      "special": false,
      "content": "ing",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "`": 35,
      "a": 36,
      "b": 37,
      "c": 38,
      "d": 39,
      "e": 40,
      "f": 41,
      "g": 42,
      "h": 43,
      "i": 44,
      "j": 45,
      "k": 46,
      "l": 47,
      "m": 48,
      "n": 49,
      "o": 50,
      "p": 51,
      "q": 52,
      "r": 53,
      "s": 54,
      "t": 55,
      "u": 56,
      "v": 57,
      "w": 58,
      "x": 59,
      "y": 60,
      "z": 61,
      "~": 62,
      "¢": 63,
      "¦": 64,
      "§": 65,
      "¨": 66,
      "¬": 67,
      "­": 68,
      "®": 69,
      "³": 70,
      "´": 71,
      "µ": 72,
      "¶": 73,
      "·": 74,
      "¹": 75,
      "º": 76,
      "»": 77,
      "×": 78,
      "÷": 79,
      "þ": 80,
      "ƒ": 81,
      "अ": 82,
      "आ": 83,
      "इ": 84,
      "ई": 85,
      "उ": 86,
      "ऊ": 87,
      "ऋ": 88,
      "ऌ": 89,
      "ऍ": 90,
      "ए": 91,
      "ऐ": 92,
      "ऑ": 93,
      "ओ": 94,
      "औ": 95,
      "क": 96,
      "ख": 97,
      "ग": 98,
      "घ": 99,
      "ङ": 100,
      "च": 101,
      "छ": 102,
      "ज": 103,
      "झ": 104,
      "ञ": 105,
      "ट": 106,
      "ठ": 107,
      "ड": 108,
      "ढ": 109,
      "ण": 110,
      "त": 111,
      "थ": 112,
      "द": 113,
      "ध": 114,
      "न": 115,
      "प": 116,
      "फ": 117,
      "ब": 118,
      "भ": 119,
      "म": 120,
      "य": 121,
      "र": 122,
      "ल": 123,
      "ळ": 124,
      "व": 125,
      "श": 126,
      "ष": 127,
      "स": 128,
      "ह": 129,
      "ऽ": 130,
      "ॐ": 131,
      "ॠ": 132,
      "।": 133,
      "॥": 134,
      "०": 135,
      "१": 136,
      "२": 137,
      "३": 138,
      "४": 139,
      "५": 140,
      "६": 141,
      "७": 142,
      "८": 143,
      "९": 144,
      "ॲ": 145,
      "​": 146,
      "‌": 147,
      "‍": 148,
      "‎": 149,
      "–": 150,
      "—": 151,
      "‘": 152,
      "’": 153,
      "“": 154,
      "”": 155,
      "†": 156,
      "‡": 157,
      "•": 158,
      "…": 159,
      "′": 160,
      "™": 161,
      "☺": 162,
      "﻿": 163,
      "ﾄ": 164,
      "##ट": 165,
      "##र": 166,
      "##क": 167,
      "##5": 168,
      "##3": 169,
      "##7": 170,
      "##4": 171,
      "##8": 172,
      "##9": 173,
      "##ण": 174,
      "##स": 175,
      "##म": 176,
      "##ध": 177,
      "##न": 178,
      "##2": 179,
      "##6": 180,
      "##ठ": 181,
      "##व": 182,
      "##य": 183,
      "##त": 184,
      "##ड": 185,
      "##च": 186,
      "##ल": 187,
      "##0": 188,
      "##ग": 189,
      "##1": 190,
      "##ष": 191,
      "##श": 192,
      "##ढ": 193,
      "##प": 194,
      "##थ": 195,
      "##ई": 196,
      "##ह": 197,
      "##द": 198,
      "##भ": 199,
      "##ख": 200,
      "##ज": 201,
      "##५": 202,
      "##७": 203,
      "##r": 204,
      "##e": 205,
      "##s": 206,
      "##t": 207,
      "##o": 208,
      "##n": 209,
      "##ळ": 210,
      "##ब": 211,
      "##उ": 212,
      "##h": 213,
      "##a": 214,
      "##v": 215,
      "##p": 216,
      "##u": 217,
      "##‍": 218,
      "##इ": 219,
      "##झ": 220,
      "##ञ": 221,
      "##अ": 222,
      "##ओ": 223,
      "##फ": 224,
      "##ए": 225,
      "##आ": 226,
      "##४": 227,
      "##९": 228,
      "##‌": 229,
      "##ऊ": 230,
      "##घ": 231,
      "##छ": 232,
      "##ƒ": 233,
      "##w": 234,
      "##ऐ": 235,
      "##ङ": 236,
      "##२": 237,
      "##३": 238,
      "##g": 239,
      "##d": 240,
      "##i": 241,
      "##y": 242,
      "##l": 243,
      "##m": 244,
      "##z": 245,
      "##०": 246,
      "##१": 247,
      "##६": 248,
      "##c": 249,
      "##b": 250,
      "##k": 251,
      "##ऍ": 252,
      "##ऽ": 253,
      "##f": 254,
      "##८": 255,
      "##ऑ": 256,
      "##º": 257,
      "##ॠ": 258,
      "##’": 259,
      "##x": 260,
      "##औ": 261,
      "##j": 262,
      "##ऋ": 263,
      "##&": 264,
      "##-": 265,
      "##,": 266,
      "##(": 267,
      "##।": 268,
      "##`": 269,
      "##þ": 270,
      "##q": 271,
      "##…": 272,
      "##.": 273,
      "##‘": 274,
      "##/": 275,
      "##†": 276,
      "##­": 277,
      "##ऌ": 278,
      "##ॲ": 279,
      "##'": 280,
      "##:": 281,
      "##³": 282,
      "##)": 283,
      "##™": 284,
      "##॥": 285
    }
  }
}